app/controllers/home_controller.rb

SELECT "test_logins".* FROM "test_logins"
SELECT "products".* FROM "products"
---
  def main
    @users = TestLogin.all
    @products = Product.all

INSERT INTO "products" ("name", "current_price", "previous_price", "product_link", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "products".* FROM "products"
---
  def new
    if params != nil
      (@products1 = Product.new(name:params[:name],product_link:params[:product_link],previous_price:params[:previous_price],current_price:params[:current_price],image_url:params[:image_url])) if (params[:product_link]!=nil)
    end
    if @products1.save
      @products = Product.all